In [13]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [16]:
df = pd.read_csv('Diwali Sales Data.csv', encoding = 'unicode_escape')

In [17]:
df.shape

(11251, 15)

In [21]:
df.head(10)

,User_ID,Cust_name,Product_ID,Gender,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
0,1002903,Sanskriti,P00125942,F,26-35,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.00,NaN,NaN
1,1000732,Kartik,P00110942,F,26-35,35,1,Andhra Pradesh,Southern,Govt,Auto,3,23934.00,NaN,NaN
2,1001990,Bindu,P00118542,F,26-35,35,1,Uttar Pradesh,Central,Automobile,Auto,3,23924.00,NaN,NaN
3,1001425,Sudevi,P00237842,M,0-17,16,0,Karnataka,Southern,Construction,Auto,2,23912.00,NaN,NaN
4,1000588,Joni,P00057942,M,26-35,28,1,Gujarat,Western,Food Processing,Auto,2,23877.00,NaN,NaN
5,1000588,Joni,P00057942,M,26-35,28,1,Himachal Pradesh,Northern,Food Processing,Auto,1,23877.00,NaN,NaN
6,1001132,Balk,P00018042,F,18-25,25,1,Uttar Pradesh,Central,Lawyer,Auto,4,23841.00,NaN,NaN
7,1002092,Shivangi,P00273442,F,55+,61,0,Maharashtra,Western,IT Sector,Auto,1,NaN,NaN,NaN
8,1003224,Kushal,P00205642,M,26-35,35,0,Uttar Pradesh,Central,Govt,Auto,2,23809.00,NaN,NaN
9,1003650,Ginny,P00031142,F,26-35,26,1,Andhra Pradesh,Southern,Media,Auto,4,23799.99,NaN,NaN

In [22]:
df.tail(10)

,User_ID,Cust_name,Product_ID,Gender,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
11241,1003032,Matthias,P00058042,F,26-35,33,0,Delhi,Central,Hospitality,Office,3,384.0,NaN,NaN
11242,1004344,Hildebrand,P00185442,F,26-35,27,1,Delhi,Central,Healthcare,Office,2,382.0,NaN,NaN
11243,1005446,Sheetal,P00297742,M,51-55,53,0,Gujarat,Western,Healthcare,Office,1,382.0,NaN,NaN
11244,1005446,Sheetal,P00297742,M,51-55,53,0,Madhya Pradesh,Central,Healthcare,Office,2,382.0,NaN,NaN
11245,1004140,Bertelson,P00057442,F,26-35,31,1,Delhi,Central,Aviation,Office,2,381.0,NaN,NaN
11246,1000695,Manning,P00296942,M,18-25,19,1,Maharashtra,Western,Chemical,Office,4,370.0,NaN,NaN
11247,1004089,Reichenbach,P00171342,M,26-35,33,0,Haryana,Northern,Healthcare,Veterinary,3,367.0,NaN,NaN
11248,1001209,Oshin,P00201342,F,36-45,40,0,Madhya Pradesh,Central,Textile,Office,4,213.0,NaN,NaN
11249,1004023,Noonan,P00059442,M,36-45,37,0,Karnataka,Southern,Agriculture,Office,3,206.0,NaN,NaN
11250,1002744,Brumley,P00281742,F,18-25,19,0,Maharashtra,Western,Healthcare,Office,3,188.0,NaN,NaN

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11251 entries, 0 to 11250
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   User_ID           11251 non-null  int64
 1   Cust_name         11251 non-null  object
 2   Product_ID        11251 non-null  object
 3   Gender            11251 non-null  object
 4   Age Group         11251 non-null  object
 5   Age               11251 non-null  int64
 6   Marital_Status    11251 non-null  int64
 7   State             11251 non-null  object
 8   Zone              11251 non-null  object
 9   Occupation        11251 non-null  object
 10  Product_Category  11251 non-null  object
 11  Orders            11251 non-null  int64
 12  Amount            11239 non-null  float64
 13  Status            0 non-null      float64
 14  unnamed1          0 non-null      float64
dtypes: float64(3), int64(4), object(8)
memory usage: 1.3+ MB

In [25]:
df.drop(['Status', 'unnamed1'], axis = 1, inplace = True)

In [29]:
df.shape

(11251, 13)

In [ ]:
pd.isnull(df).sum()

User_ID              0
Cust_name            0
Product_ID           0
Gender               0
Age Group            0
Age                  0
Marital_Status       0
State                0
Zone                 0
Occupation           0
Product_Category     0
Orders               0
Amount              12
dtype: int64

In [34]:
df.shape

(11251, 13)

In [35]:
df.dropna(inplace=True)

In [36]:
df.shape

(11239, 13)

In [47]:
data_test = [["shiva", 19], ['vijay ', ], ['john', 21], ['doe', 37]]
df_frame = pd.DataFrame(data_test, columns=['Name', 'Age'])
df_frame

      Name   Age
0    shiva  19.0
1   vijay    NaN
2   tanisq  21.0
3  santosh  37.0

In [52]:
# how to change the datatype 

df['Amount'] = df['Amount'].astype('int')

In [54]:
df['Amount'].dtypes

dtype('int64')

In [55]:
df.columns

Index(['User_ID', 'Cust_name', 'Product_ID', 'Gender', 'Age Group', 'Age',
       'Marital_Status', 'State', 'Zone', 'Occupation', 'Product_Category',
       'Orders', 'Amount'],
      dtype='object')

In [63]:
#rename the column
df.rename(columns = {'Gender': 'Sex'}, inplace= True)

In [64]:
df.columns

Index(['User_ID', 'Cust_name', 'Product_ID', 'Sex', 'Age Group', 'Age',
       'Marital_Status', 'State', 'Zone', 'Occupation', 'Product_Category',
       'Orders', 'Amount'],
      dtype='object')

In [65]:
df.describe()

            User_ID           Age  Marital_Status        Orders        Amount
count  1.123900e+04  11239.000000    11239.000000  11239.000000  11239.000000
mean   1.003004e+06     35.410357        0.420055      2.489634   9453.610553
std    1.716039e+03     12.753866        0.493589      1.114967   5222.355168
min    1.000001e+06     12.000000        0.000000      1.000000    188.000000
25%    1.001492e+06     27.000000        0.000000      2.000000   5443.000000
50%    1.003064e+06     33.000000        0.000000      2.000000   8109.000000
75%    1.004426e+06     43.000000        1.000000      3.000000  12675.000000
max    1.006040e+06     92.000000        1.000000      4.000000  23952.000000

In [68]:
df[["Amount", "Orders"]].describe()

             Amount        Orders
count  11239.000000  11239.000000
mean    9453.610553      2.489634
std     5222.355168      1.114967
min      188.000000      1.000000
25%     5443.000000      2.000000
50%     8109.000000      2.000000
75%    12675.000000      3.000000
max    23952.000000      4.000000

In [71]:
sns.countplot(x = 'Gender', data = df)

NameError: name 'sns' is not defined

In [75]:
# most amount spend by gender and total sum 

sales_gn = df.groupby(['Sex'], as_index = False)['Amount'].sum().sort_values(by= 'Amount', ascending = False)

In [76]:
sales_gn

  Sex    Amount
0   F  74335853
1   M  31913276

In [77]:
#most amount spend by gender and total sum descending

sales_gn = df.groupby(['Sex'], as_index= False)['Amount'].sum().sort_values(by= 'Amount', ascending = True)

In [80]:
sns.barplot(x = 'Sex', y = 'Amount', data= sales_gn)

NameError: name 'sns' is not defined

In [87]:
# most amount spend by particular age group
sales_gn = df.groupby(['Age Group'], as_index= False)['Amount'].sum().sort_values(by='Amount', ascending = False)

In [86]:
sales_gn

  Age Group    Amount
2     26-35  42613442
3     36-45  22144994
1     18-25  17240732
4     46-50   9207844
5     51-55   8261477
6       55+   4080987
0      0-17   2699653

In [83]:
df.columns

Index(['User_ID', 'Cust_name', 'Product_ID', 'Sex', 'Age Group', 'Age',
       'Marital_Status', 'State', 'Zone', 'Occupation', 'Product_Category',
       'Orders', 'Amount'],
      dtype='object')

In [88]:
# most money spend by particular state

sales_state = df.groupby(['State'], as_index = False)['Amount'].sum().sort_values(by = 'Amount', ascending = False)

In [89]:
sales_state

               State    Amount
14     Uttar Pradesh  19374968
10       Maharashtra  14427543
7          Karnataka  13523540
2              Delhi  11603818
9     Madhya Pradesh   8101142
0     Andhra Pradesh   8037146
5   Himachal Pradesh   4963368
4            Haryana   4220175
1              Bihar   4022757
3            Gujarat   3946082
8             Kerala   3894491
6          Jharkhand   3026456
15       Uttarakhand   2520944
12         Rajasthan   1909409
11            Punjab   1525800
13         Telangana   1151490

In [98]:
# most orders recieved by particular state
sales_or = df.groupby(['State'], as_index= False)['Orders'].sum().sort_values(by="Orders", ascending = False)

In [99]:
sales_or

               State  Orders
14     Uttar Pradesh    4807
10       Maharashtra    3810
7          Karnataka    3240
2              Delhi    2740
9     Madhya Pradesh    2252
0     Andhra Pradesh    2051
5   Himachal Pradesh    1568
8             Kerala    1137
4            Haryana    1109
3            Gujarat    1066
1              Bihar    1062
6          Jharkhand     953
15       Uttarakhand     824
12         Rajasthan     555
11            Punjab     495
13         Telangana     312

In [101]:
sales_mr = df.groupby(['Marital_Status', 'Sex'], as_index=False)['Amount'].sum().sort_values(by='Amount', ascending = False)

In [102]:
sales_mr

   Marital_Status Sex    Amount
0               0   F  43786646
2               1   F  30549207
1               0   M  18338738
3               1   M  13574538

In [104]:
# most amount spend by particular occupation

sales_sec= df.groupby(['Occupation'], as_index= False)['Amount'].sum().sort_values(by='Amount', ascending=False)

In [105]:
sales_sec

         Occupation    Amount
10        IT Sector  14755079
8        Healthcare  13034586
2          Aviation  12602298
3           Banking  10770610
7              Govt   8517212
9       Hospitality   6376405
12            Media   6295832
1        Automobile   5368596
4          Chemical   5297436
11           Lawyer   4981665
13           Retail   4783170
6   Food Processing   4070670
5      Construction   3597511
14          Textile   3204972
0       Agriculture   2593087

In [108]:
# most amount spend in  particular product_category
sales_ct = df.groupby(['Product_Category'], as_index=False)['Amount'].sum().sort_values(by= 'Amount', ascending = False)

In [109]:
sales_ct

         Product_Category    Amount
6                    Food  33933883
3      Clothing & Apparel  16495019
5   Electronics & Gadgets  15643846
7        Footwear & Shoes  15575209
8               Furniture   5440051
9            Games & Toys   4331694
14        Sports Products   3635933
1                  Beauty   1959484
0                    Auto   1958609
15             Stationery   1676051
11        Household items   1569337
16             Tupperware   1155642
2                   Books   1061478
4                   Decor    730360
13               Pet Care    482277
10     Hand & Power Tools    405618
17             Veterinary    112702
12                 Office     81936

In [111]:
# most order recieved in that particular product_category
sales_or = df.groupby(['Product_Category'], as_index=False)['Orders'].sum().sort_values(by= 'Orders', ascending = False)

In [112]:
sales_or

         Product_Category  Orders
3      Clothing & Apparel    6634
6                    Food    6110
5   Electronics & Gadgets    5226
7        Footwear & Shoes    2646
11        Household items    1331
1                  Beauty    1086
9            Games & Toys     940
8               Furniture     889
14        Sports Products     870
13               Pet Care     536
15             Stationery     281
12                 Office     261
2                   Books     245
0                    Auto     239
4                   Decor     235
17             Veterinary     206
16             Tupperware     166
10     Hand & Power Tools      80

In [114]:
# most amount spend by Product_ID
sales_or = df.groupby(['Product_ID'], as_index = False)['Amount'].sum().sort_values(by= 'Amount', ascending = False )

In [115]:
sales_or

     Product_ID  Amount
1679  P00265242  540136
644   P00110942  424833
1146  P00184942  401816
654   P00112142  341020
396   P00059442  338571
...         ...     ...
1356  P00216242     748
745   P00121942     744
1940  P00307142     572
300   P00044742     396
1888  P00296942     370

[2350 rows x 2 columns]

In [116]:
# most amount spend by particular name

sales_name = df.groupby(['Cust_name'], as_index=False)['Amount'].sum().sort_values(by='Amount', ascending=False)

In [117]:
sales_name

        Cust_name  Amount
1196     Vishakha  382782
1102       Sudevi  287142
1185      Vasudev  281034
800         Neola  275234
28      Alejandro  272517
...           ...     ...
554       Jayanti   14416
751       Michael   12965
641         Laal     9563
804        Nicole    8432
684   Madan Mohan    7420

[1250 rows x 2 columns]